Autodesk.Revit.DB.RevitLinkType.Unload(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback)
Unloads the Revit link.
Remarks:
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
callback:
A callback indicating what to do if Revit encounters
links which have changes in shared coordinates.
If null, Revit will not save any shared coordinates
changes to the link before unloading.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
Revit could not save shared coordinates changes to the link
or one of its nested links.
-or-
There was a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link from disk.
The link will be loaded from the input path.
Remarks:
The input path must be absolute. Revit will store
an absolute or relative path internally, according
to the link's settings. Revit Server paths are acceptable.
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input path
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
path:
A ModelPath indicating where to load the link from.
This must be an absolute path.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input path "path" does not represent a Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at path's location
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There was a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link.
The link will be loaded from the location given in the
input ExternalResourceReference.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
resourceReference:
An external resource reference describing the source of the linked Revit document.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support Revit links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There was a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Reload
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This function is identical to RevitLinkType.Load() and is included for
convenience.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
RevitLinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There was a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Load
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
RevitLinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There was a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.UpdateFromIFC(Autodesk.Revit.DB.Document,System.String,System.String,System.Boolean)
Updates a Revit link type from an IFC file and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
Note that the IFC file will not be stored directly in the document; it will
instead by stored in an intermediate Revit document, whose location is given
by revitLinkedFilePath.
document:
The document that contains Revit link.
ifcFilePath:
The path of the IFC link to load. This must be a full path.
revitLinkedFilePath:
The path of the Revit file to create to hold the IFC information. This must be a full path.
recreateLink:
If true, the Revit file will be updated based on the information in the IFC file.  If false, the existing Revit file will be used.
Returns:
Returns true if the update succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input path "ifcFilePath" does not represent an IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at ifcFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.CreateFromIFC(Autodesk.Revit.DB.Document,System.String,System.String,System.Boolean,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type from an IFC file and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
Note that the IFC file will not be stored directly in the document; it will
instead by stored in an intermediate Revit document, whose location is given
by revitLinkedFilePath.
document:
The document in which to create the Revit link.
ifcFilePath:
The path of the IFC link to load. This must be a full path.
revitLinkedFilePath:
The path of the Revit file to create to hold the IFC information. This must be a full path.
recreateLink:
If true, the Revit file will be updated based on the information in the IFC file.  If false, the existing Revit file will be used.
options:
An options class for loading Revit links.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input path "ifcFilePath" does not represent an IFC file.
-or-
document already contains a linked model at path revitLinkedFilePath.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at ifcFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015